In [1]:
import pandas as pd

#### 데이터프레임 구성하기

In [2]:
xlsx = pd.read_excel('http://itpaper.co.kr/data/grade_card.xlsx', engine='openpyxl')
df = xlsx.set_index('이름')
df

    학년  성별   국어    영어    수학    과학
이름
철수   1  남자   98   NaN  88.0  64.0
영희   2  여자   88  90.0  62.0  72.0
민수   1  남자   92  70.0   NaN   NaN
수현   3  여자   63  60.0  31.0  70.0
호영   4  남자  120  50.0   NaN  88.0

### 데이터에 접근하기

In [3]:
# 1) 데이터 개요 확인
# 데이터의 크기(행, 열)확인

print(df.shape)

(5, 6)

In [5]:
# 행, 열 크기를 서로 다른 변수에 나누어 저장하기 (튜플)
rows, cols = df.shape
print(rows)
print(cols)

5
6

In [6]:
# 상위 3건 확인
df.head(3)

    학년  성별  국어    영어    수학    과학
이름
철수   1  남자  98   NaN  88.0  64.0
영희   2  여자  88  90.0  62.0  72.0
민수   1  남자  92  70.0   NaN   NaN

In [7]:
# 하위 3건 확인
df.tail(3)

    학년  성별   국어    영어    수학    과학
이름
민수   1  남자   92  70.0   NaN   NaN
수현   3  여자   63  60.0  31.0  70.0
호영   4  남자  120  50.0   NaN  88.0

In [8]:
# 인덱스 이름 확인
df.index

Index(['철수', '영희', '민수', '수현', '호영'], dtype='object', name='이름')

In [11]:
# 인덱스 이름을 리스트로 변환
i_list = list(df.index)
i_list

['철수', '영희', '민수', '수현', '호영']

In [12]:
# 컬럼 이름 확인
df.columns

Index(['학년', '성별', '국어', '영어', '수학', '과학'], dtype='object')

In [13]:
# 컬럼 이름을 리스트로 변환
c_list = list(df.columns)
c_list

['학년', '성별', '국어', '영어', '수학', '과학']

In [14]:
# 데이터의 값들만 확인
print(type(df.values))
df.values

<class 'numpy.ndarray'>

array([[1, '남자', 98, nan, 88.0, 64.0],
       [2, '여자', 88, 90.0, 62.0, 72.0],
       [1, '남자', 92, 70.0, nan, nan],
       [3, '여자', 63, 60.0, 31.0, 70.0],
       [4, '남자', 120, 50.0, nan, 88.0]], dtype=object)

In [16]:
# 전치 구하기 (테이블 뒤집기)
# 데이터프레임 T속성을 통해 전치형태의 데이터프레임을 확인가능
df.T

이름    철수    영희    민수    수현    호영
학년     1     2     1     3     4
성별    남자    여자    남자    여자    남자
국어    98    88    92    63   120
영어   NaN  90.0  70.0  60.0  50.0
수학  88.0  62.0   NaN  31.0   NaN
과학  64.0  72.0   NaN  70.0  88.0

### 열단위의 데이터 접근

In [17]:
# 각 열별로 데이터 타입 확인
# 데이터프레임 객체의 dtypes 속성
df.dtypes

학년      int64
성별     object
국어      int64
영어    float64
수학    float64
과학    float64
dtype: object

In [18]:
# 특정 열에 대한 타입과 값 확인
print(type(df['국어']))
df['국어']

<class 'pandas.core.series.Series'>

이름
철수     98
영희     88
민수     92
수현     63
호영    120
Name: 국어, dtype: int64

In [19]:
# 특정 열의 값들을 numpy 배열로 변환
arr = df['국어'].values
print(type(arr))
arr

<class 'numpy.ndarray'>

array([ 98,  88,  92,  63, 120], dtype=int64)

In [20]:
# 특졍 열의 값들을 list로 변환
ls = list(df['국어'])
print(type(ls))
ls

<class 'list'>

[98, 88, 92, 63, 120]

### 행 단위로 접근하기
반드시 loc 라는 속성을 통해서 접근해야 한다.

In [21]:
# 하나의 행에 속한 모든 데이터 추출
cs = df.loc['철수']
print(type(cs))
cs

<class 'pandas.core.series.Series'>

학년       1
성별      남자
국어      98
영어     NaN
수학    88.0
과학    64.0
Name: 철수, dtype: object

In [30]:
# 특정 행의 값들을 numpy 배열로 변환
arr = df.loc['철수'].values
print(type(arr))
arr

<class 'numpy.ndarray'>

array([1, '남자', 98, nan, 88.0, 64.0], dtype=object)

In [31]:
# 특정행의 값들을 list로 변환
ls = list(df.loc['철수'])
print(type(ls))
ls

<class 'list'>

[1, '남자', 98, nan, 88.0, 64.0]

### 특정 위치의 값에 직접 접근

In [34]:
# 열 -> 행 순으로 접근하기
# 데이터프레임객체[열][행] 순으로 명시한다

df['국어']['철수']

98

In [33]:
# 행 -> 열 순으로 접근하기
# `데이터프레임객체.loc[행,열]` 순으로 명시한다.

df.loc['철수', '국어']

98

In [35]:
# 특정 값 변경하기
df.loc['철수', '국어'] = 99
df

    학년  성별   국어    영어    수학    과학
이름
철수   1  남자   99   NaN  88.0  64.0
영희   2  여자   88  90.0  62.0  72.0
민수   1  남자   92  70.0   NaN   NaN
수현   3  여자   63  60.0  31.0  70.0
호영   4  남자  120  50.0   NaN  88.0